; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-3-5-2-6-6)
    (:domain grid)
    (:objects
    pos0-0 pos0-1 pos0-2 pos0-3 pos0-4 pos1-0 pos1-1 pos1-2 pos1-3 pos1-4 pos2-0 pos2-1 pos2-2 pos2-3 pos2-4
    shape0 shape1
    key0 key1 key2 key3 key4 key5
    )

    (:init
       (arm-empty)

       (place pos0-0)
       (place pos0-1)
       (place pos0-2)
       (place pos0-3)
       (place pos0-4)
       (place pos1-0)
       (place pos1-1)
       (place pos1-2)
       (place pos1-3)
       (place pos1-4)
       (place pos2-0)
       (place pos2-1)
       (place pos2-2)
       (place pos2-3)
       (place pos2-4)
       (shape shape0)
       (shape shape1)
       (key key0)
       (key key1)
       (key key2)
       (key key3)
       (key key4)
       (key key5)

       (conn pos0-0 pos1-0)
       (conn pos0-0 pos0-1)
       (conn pos0-1 pos1-1)
       (conn pos0-1 pos0-2)
       (conn pos0-1 pos0-0)
       (conn pos0-2 pos1-2)
       (conn pos0-2 pos0-3)
       (conn pos0-2 pos0-1)
       (conn pos0-3 pos1-3)
       (conn pos0-3 pos0-4)
       (conn pos0-3 pos0-2)
       (conn pos0-4 pos1-4)
       (conn pos0-4 pos0-3)
       (conn pos1-0 pos2-0)
       (conn pos1-0 pos1-1)
       (conn pos1-0 pos0-0)
       (conn pos1-1 pos2-1)
       (conn pos1-1 pos1-2)
       (conn pos1-1 pos0-1)
       (conn pos1-1 pos1-0)
       (conn pos1-2 pos2-2)
       (conn pos1-2 pos1-3)
       (conn pos1-2 pos0-2)
       (conn pos1-2 pos1-1)
       (conn pos1-3 pos2-3)
       (conn pos1-3 pos1-4)
       (conn pos1-3 pos0-3)
       (conn pos1-3 pos1-2)
       (conn pos1-4 pos2-4)
       (conn pos1-4 pos0-4)
       (conn pos1-4 pos1-3)
       (conn pos2-0 pos2-1)
       (conn pos2-0 pos1-0)
       (conn pos2-1 pos2-2)
       (conn pos2-1 pos1-1)
       (conn pos2-1 pos2-0)
       (conn pos2-2 pos2-3)
       (conn pos2-2 pos1-2)
       (conn pos2-2 pos2-1)
       (conn pos2-3 pos2-4)
       (conn pos2-3 pos1-3)
       (conn pos2-3 pos2-2)
       (conn pos2-4 pos1-4)
       (conn pos2-4 pos2-3)
       (locked pos0-4)
       (locked pos2-0)
       (locked pos1-1)
       (locked pos0-2)
       (locked pos1-0)
       (locked pos1-3)
       (lock-shape  pos0-4 shape0)
       (lock-shape  pos2-0 shape1)
       (lock-shape  pos1-1 shape1)
       (lock-shape  pos0-2 shape1)
       (lock-shape  pos1-0 shape1)
       (lock-shape  pos1-3 shape1)
       (open pos0-0)
       (open pos0-1)
       (open pos0-3)
       (open pos1-2)
       (open pos1-4)
       (open pos2-1)
       (open pos2-2)
       (open pos2-3)
       (open pos2-4)

       (key-shape  key0 shape0)
       (key-shape  key1 shape1)
       (key-shape  key2 shape1)
       (key-shape  key3 shape0)
       (key-shape  key4 shape0)
       (key-shape  key5 shape1)
       (at key0 pos0-4)
       (at key1 pos0-0)
       (at key2 pos2-0)
       (at key3 pos0-4)
       (at key4 pos2-1)
       (at key5 pos1-0)
       (at-robot pos0-0)
    )

    (:goal (and
       (at key3 pos1-4)
       (at key4 pos2-3)
    )))

; plan
1. (pickup pos0-0 key1)
   deleted: (at key1 pos0-0) (arm-empty)
   added: (holding key1)
   goals met: 0 of 2
2. (move pos0-0 pos0-1)
   deleted: (at-robot pos0-0)
   added: (at-robot pos0-1)
   goals met: 0 of 2
3. (unlock pos0-1 pos1-1 key1 shape1)
   deleted: (locked pos1-1)
   added: (open pos1-1)
   goals met: 0 of 2
4. (move pos0-1 pos1-1)
   deleted: (at-robot pos0-1)
   added: (at-robot pos1-1)
   goals met: 0 of 2
5. (move pos1-1 pos2-1)
   deleted: (at-robot pos1-1)
   added: (at-robot pos2-1)
   goals met: 0 of 2
6. (pickup-and-loose pos2-1 key4 key1)
   deleted: (holding key1) (at key4 pos2-1)
   added: (holding key4) (at key1 pos2-1)
   goals met: 0 of 2
7. (move pos2-1 pos2-2)
   deleted: (at-robot pos2-1)
   added: (at-robot pos2-2)
   goals met: 0 of 2
8. (move pos2-2 pos2-3)
   deleted: (at-robot pos2-2)
   added: (at-robot pos2-3)
   goals met: 0 of 2
9. (move pos2-3 pos2-4)
   deleted: (at-robot pos2-3)
   added: (at-robot pos2-4)
   goals met: 0 of 2
10. (move pos2-4 pos1-4)
   deleted: (at-robot pos2-4)
   added: (at-robot pos1-4)
   goals met: 0 of 2
11. (unlock pos1-4 pos0-4 key4 shape0)
   deleted: (locked pos0-4)
   added: (open pos0-4)
   goals met: 0 of 2
12. (putdown pos1-4 key4)
   deleted: (holding key4)
   added: (arm-empty) (at key4 pos1-4)
   goals met: 0 of 2
13. (move pos1-4 pos0-4)
   deleted: (at-robot pos1-4)
   added: (at-robot pos0-4)
   goals met: 0 of 2
14. (pickup pos0-4 key3)
   deleted: (at key3 pos0-4) (arm-empty)
   added: (holding key3)
   goals met: 0 of 2
15. (move pos0-4 pos1-4)
   deleted: (at-robot pos0-4)
   added: (at-robot pos1-4)
   goals met: 0 of 2
16. (pickup-and-loose pos1-4 key4 key3)
   deleted: (holding key3) (at key4 pos1-4)
   added: (holding key4) (at key3 pos1-4)
   goals met: 1 of 2
17. (move pos1-4 pos2-4)
   deleted: (at-robot pos1-4)
   added: (at-robot pos2-4)
   goals met: 1 of 2
18. (move pos2-4 pos2-3)
   deleted: (at-robot pos2-4)
   added: (at-robot pos2-3)
   goals met: 1 of 2
19. (putdown pos2-3 key4)
   deleted: (holding key4)
   added: (arm-empty) (at key4 pos2-3)
   goals met: 2 of 2
